Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH01/atdf/PIC32CM2532JH01100.atdf
          </instance>
        </module>
        <module name="DMAC" id="U2223" version="2.4.0">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="CH_BITS" value="4" caption="Number of bits to select channel"/>
              <param name="CH_NUM" value="12" caption="Number of channels"/>
              <param name="EVIN_NUM" value="4" caption="Number of input events"/>
              <param name="EVOUT_NUM" value="4" caption="Number of output events"/>
              <param name="LVL_BITS" value="2" caption="Number of bit to select level priority"/>
              <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2" caption="QOS dmac ahb interface reset value"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2" caption="QOS dmac fetch interface reset value"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2" caption="QOS dmac write back interface reset value"/>
              <param name="SPLIT_IRQ_NUM" value="0" caption="Number of IRQ split out"/>
              <param name="TRIG_BITS" value="6" caption="Number of bits to select trigger source"/>
              <param name="TRIG_NUM" value="63" caption="Number of peripheral triggers"/>
              <param name="INSTANCE_ID" value="35" caption="Instance index for DMAC"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2209" version="3.0.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <register-group name="DSU_EXT" name-in-module="DSU" address-space="base" offset="0x41002100" size="0x100"/>
            <parameters>
              <param name="INSTANCE_ID" value="33" caption="Instance index for DSU"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2254" version="3.1.0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PB16"/>
              <signal group="EXTINT" index="0" function="A" pad="PC08"/>
              <signal group="EXTINT" index="0" function="A" pad="PC24"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB17"/>
              <signal group="EXTINT" index="1" function="A" pad="PC09"/>
              <signal group="EXTINT" index="1" function="A" pad="PC25"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="2" function="A" pad="PB18"/>
              <signal group="EXTINT" index="2" function="A" pad="PC10"/>
              <signal group="EXTINT" index="2" function="A" pad="PC26"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="3" function="A" pad="PB19"/>
              <signal group="EXTINT" index="3" function="A" pad="PC11"/>
              <signal group="EXTINT" index="3" function="A" pad="PC27"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="4" function="A" pad="PB20"/>
              <signal group="EXTINT" index="4" function="A" pad="PC12"/>
              <signal group="EXTINT" index="4" function="A" pad="PC28"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="5" function="A" pad="PB21"/>
              <signal group="EXTINT" index="5" function="A" pad="PC13"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="6" function="A" pad="PC14"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="7" function="A" pad="PC15"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="8" function="A" pad="PB24"/>
              <signal group="EXTINT" index="8" function="A" pad="PC00"/>
              <signal group="EXTINT" index="8" function="A" pad="PC16"/>
              <signal group="EXTINT" index="8" function="A" pad="PA28"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB25"/>
              <signal group="EXTINT" index="9" function="A" pad="PC01"/>
              <signal group="EXTINT" index="9" function="A" pad="PC17"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PA30"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="10" function="A" pad="PC02"/>
              <signal group="EXTINT" index="10" function="A" pad="PC18"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA31"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="11" function="A" pad="PC03"/>
              <signal group="EXTINT" index="11" function="A" pad="PC19"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PA24"/>
              <signal group="EXTINT" index="12" function="A" pad="PB12"/>
              <signal group="EXTINT" index="12" function="A" pad="PC20"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PA25"/>
              <signal group="EXTINT" index="13" function="A" pad="PB13"/>
              <signal group="EXTINT" index="13" function="A" pad="PC05"/>
              <signal group="EXTINT" index="13" function="A" pad="PC21"/>
              <signal group="EXTINT" index="14" function="A" pad="PB14"/>
              <signal group="EXTINT" index="14" function="A" pad="PB30"/>
              <signal group="EXTINT" index="14" function="A" pad="PC06"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA27"/>
              <signal group="EXTINT" index="15" function="A" pad="PB15"/>
              <signal group="EXTINT" index="15" function="A" pad="PB31"/>
              <signal group="EXTINT" index="15" function="A" pad="PC07"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16" caption="Number of external interrupts"/>
              <param name="GCLK_ID" value="2" caption="Generic Clock index"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2" caption="Number of CONFIG registers"/>
              <param name="NUMBER_OF_DPRESCALER_REGS" value="2" caption="Number of DPRESCALER registers"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16" caption="Number of external interrupts (obsolete)"/>
              <param name="INSTANCE_ID" value="10" caption="Instance index for EIC"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2256" version="1.0.2">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="CHANNELS" value="12" caption="Number of Channels"/>
              <param name="CHANNELS_BITS" value="4" caption="Number of bits to select Channel"/>
              <param name="CHANNELS_MSB" value="11" caption="Number of Channels - 1"/>
              <param name="EXTEVT_NUM" value="0" caption="Number of External Event Generators"/>
              <param name="GCLK_ID_0" value="5" caption="Index of Generic Clock 0"/>
              <param name="GCLK_ID_1" value="6" caption="Index of Generic Clock 1"/>
              <param name="GCLK_ID_2" value="7" caption="Index of Generic Clock 2"/>
              <param name="GCLK_ID_3" value="8" caption="Index of Generic Clock 3"/>
              <param name="GCLK_ID_4" value="9" caption="Index of Generic Clock 4"/>
              <param name="GCLK_ID_5" value="10" caption="Index of Generic Clock 5"/>
              <param name="GCLK_ID_6" value="11" caption="Index of Generic Clock 6"/>
              <param name="GCLK_ID_7" value="12" caption="Index of Generic Clock 7"/>
              <param name="GCLK_ID_8" value="13" caption="Index of Generic Clock 8"/>
              <param name="GCLK_ID_9" value="14" caption="Index of Generic Clock 9"/>
              <param name="GCLK_ID_10" value="15" caption="Index of Generic Clock 10"/>
              <param name="GCLK_ID_11" value="16" caption="Index of Generic Clock 11"/>
              <param name="GENERATORS" value="101" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="7" caption="Number of bits to select Event Generator"/>
              <param name="USERS" value="51" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="6" caption="Number of bits to select Event User"/>
              <param name="INSTANCE_ID" value="64" caption="Instance index for EVSYS"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="U2257" version="1.0.1">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="3" caption="Index of measure generic clock"/>
              <param name="GCLK_ID_REF" value="4" caption="Index of reference generic clock"/>
              <param name="INSTANCE_ID" value="11" caption="Instance index for FREQM"/>
            </parameters>
          </instance>
        </module>
